hw4/rottenpotatoes/app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "release_date", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["release_date", "2000-01-01 00:00:00.000000"], ["director", "test"], ["created_at", "2016-09-28 21:09:49.463890"], ["updated_at", "2016-09-28 21:09:49.463890"]]

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "title" = ?, "description" = ?, "release_date" = ?, "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "test"], ["description", nil], ["release_date", "2000-01-01 00:00:00.000000"], ["director", "test"], ["updated_at", "2016-09-28 21:26:24.642966"], ["id", 1]]

  def similar
    id = params[:id] # retrieve movie ID from URI route
    movie = Movie.find(id) # look up movie by unique ID
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]